{"editions":[{"courses":[{"title":"Shell Script","description":"Shell Script é uma linguagem de script usada em vários sistemas operacionais, principalmente em distribuições distribuições GNU/Linux utilizando o  interpretador de comandos  Bash. Este minicurso visa a introdução ao Shell Script com comandos básicos e exemplos práticos. Maiores informações no site: http://renesp.com.br/","lecturer":"Renê de Souza Pinto","field":"Linguagem de programação","scheduleBegin":"10:00","scheduleEnd":"15:00","room":"Laboratório de Informática prédio AT6","vacancies":60,"editionId":0}],"lectures":[{"title":"Introdução ao Android","description":"Android é um Sistema  Operacional de código aberto para dispositivos móveis (celulares, tablets etc) e utiliza uma versão modificada do Linux. O desenvolvimento para Android ocorre através de aplicações Java que controlam o dispositivo por bibliotecas desenvolvidas pelo Google.","lecturer":"Victor Gomes e Denis Oliveira","field":"Dispositivos móveis","scheduleBegin":"11:00","scheduleEnd":"12:00","room":"Auditório prédio AT6","editionId":0},{"title":"Usando o CMS Joomla! para gerenciar seus Blogs, Sites e Portais","description":"Apresentar as funcionalidades do Joomla que ganhou o prêmio de melhor CMS Open Source em 2011. Maiores informações no site www.julianoaugusto.com","lecturer":"Juliano Augusto","field":"Desenvolvimento Web","scheduleBegin":"13:00","scheduleEnd":"14:00","room":"Auditório prédio AT6","editionId":0},{"title":"Como Adentrar em um Mundo Livre","description":"Uma mostra do por quê e como trilhar para o uso de softwares livres sem gerar muito desconforto.\nDedicada a iniciantes em software livre.","lecturer":"Rogerio J. Gentil","field":"","scheduleBegin":"14:00","scheduleEnd":"15:00","room":"Auditório prédio AT6","editionId":0},{"title":"Desenvolvimento Livre para o Kinect","description":"O dispositivo da Microsoft o Kinect ganhou uma comunidade aberta e\nentusiasmada. Sua capacidade de desenvolvimento de aplicações para\ninterfaces gestuais é sua principal caracteristica. Uma atividade que\ninclui informações sobre o funcionamento das bibliotecas e frameworks\nexistentes e comparações de frameworks e bibliotecas.","lecturer":"Gustavo Jordan","field":"","scheduleBegin":"16:00 ","scheduleEnd":"17:00 ","room":"Auditório prédio AT6","editionId":0},{"title":"Filosofia do Software Livre","description":"A filosofia do Software Livre encontra as suas raízes na livre troca de conhecimentos e de pensamentos que podem tradicionalmente ser encontrada no campo científico. Tal como as ideias, os programas de computador não são tangíveis e podem ser copiados sem perda. A sua distribuição é a base de um processo de evolução que alimenta o desenvolvimento do pensamento. 1ª liberdade - A liberdade de executar o software, para qualquer uso. 2ª liberdade - A liberdade de estudar o funcionamento de um programa e de adaptá-lo às suas necessidades. 3ª liberdade: - A liberdade de redistribuir cópias. 4ª liberdade: - A liberdade de melhorar o programa e de tornar as modificações públicas de modo que a comunidade inteira beneficie da melhoria. O software que siga esses quatro princípios é chamado “Software Livre” (ou Free Software).","lecturer":"Carlos José Pereira","field":"Filosofia do Software Livre","scheduleBegin":"09:00","scheduleEnd":"10:00","room":"Auditório prédio AT6","editionId":0},{"title":"Introdução a Titanium Mobile SDK","description":"Introdução a SDK Open Source para desenvolvimento cross-over de\naplicativos móveis, o desenvolvimento na linguagem JavaScript  para\nSDK que gera aplicações 100% nativas nas linguagem Objective-C para\niOS e Java para Android.","lecturer":"Gustavo Jordan","field":"Dispositivos móveis","scheduleBegin":"16:00","scheduleEnd":"17:00","room":"Auditório prédio AT6","editionId":0},{"title":"O Potencial dos Jogos na Educação","description":"1 – Dados de utilização de jogos. 2 – Como surgem as idéias dos jogos. 3 – Como os jogos contribuem com a educação. 4 – Metodologia de desenvolvimento de jogos. 5 – Apresentação dos jogos já desenvolvidos. 6 – Resultados (quantidade de acesso, artigos publicados, eventos participados, premiações, etc)\nRener Baffa da Silva","lecturer":"16:00","field":"Jogos","scheduleBegin":"16:00","scheduleEnd":"17:00","room":"em breve140 prédio AT6","editionId":0},{"title":"O movimento do software livre e suas contribuições para a formação de redes de colaboração na educação","description":"O Movimento do Software Livre com o passar dos anos tem incentivado acções semelhantes em outros âmbitos da sociedade. Este trabalho busca construir um modelo de Rede de Colaboração baseado no ecossistema presente nas Comunidades de Software Livre e aplicar este modelo na educação, mais especificamente, na forma com que os educadores se relacionam. Este trabalho é a dissertação de Mestrado do Palestrante para obtenção do título de Mestre em Tecnologia e Inovação pela Faculdade de Tecnologia da UNICAMP, o qual fará a defesa em Maio/2012.","lecturer":"Alexandre Garcia Aguado","field":"Filosofia Software Livre","scheduleBegin":"15:00","scheduleEnd":"16:00","room":"Laboratório prédio AT6","editionId":0},{"title":"Traduzindo o gnu.org","description":"Apresentação o projeto www-pt-br (savannah.gnu.org/projects/www-pt-br/), cujo objetivo é a tradução para português brasileiro do http://gnu.org/, tocando em diversos pontos, especialmente o técnico (como a tradução é feita e mantida) e teórico (problemas inerentes à tradução). * Um breve histórico do Projeto GNU e sua relação com o Linux e a comunidade; * As motivações para a tradução; * O processo de tradução do ponto de vista do membro do projeto; * O processo de tradução do ponto de vista do coordenador do projeto; * Uma breve discussão sobre problemas gerais em tradução; * Os problemas e soluções encontrados. O principal objetivo é divulgar o projeto e a importância da tradução de software livre e artigos sobre software livre, que constitui um grande campo de ação, especialmente para aqueles que não podem contribuir com código.","lecturer":"Rafael Beraldo","field":"Tradução","scheduleBegin":"16:00","scheduleEnd":"17:00","room":"Laboratório prédio AT6","editionId":0},{"title":"TV Digital com Linux","description":"Trabalho de mestrado utilizando Ginga, middleware totalmente feito em LINUX pra tv digital","lecturer":"Elaine Cecília Gatto","field":"Tradução","scheduleBegin":"14:00","scheduleEnd":"15:00","room":"Auditório prédio AT6","editionId":0}],"supporters":[],"installFest":{"softwares":[]},"hostingPlace":{"name":"UFSCar AT6","address":{"street":"Rodovia Washington Luís, Km 235","number":0,"district":"Jardim Guanabara","city":"São Carlos","state":"São Paulo"},"latitude":-21.978524,"longitude":-47.881218},"year":2012},{"courses":[{"title":"Ruby","description":"O grupo PET ADS do IFSP – campus São Carlos agradece a presença e a participação de todos no minicurso de Ruby Básico. Para melhorarmos em futuros minicursos e/ou atividades para a comunidade com elogios ou críticas, o PET pede para que respondam as simples e importantes questões relacionadas ao minicurso de Ruby Básico no link a seguir: Feedback minicurso Ruby Básico. O código fonte do projeto desenvolvido no minicurso: Código-fonte(“otimizado” que há mais características do Ruby) \u0027http://www.flisolsaocarlos.net.br/material-2013/\u0027. Como falamos, os códigos em Ruby são bem legíveis, mas não quis apagar os comentários. Espero que os tenha motivado com Ruby. Qualquer dúvida, mandem emails para pet.ads.ifsp (a) gmail dot com. Bons estudos.","lecturer":"PET ADS do IFSP São Carlos","field":"Linguagem de Programação","scheduleBegin":"13:00","scheduleEnd":"16:50","room":"em brevede Informática","vacancies":50,"editionId":0},{"title":"Implementando um laboratório em LTSP.","description":"Basicamente irei mostrar o que é e como funciona o projeto LTSP e como é a estrutura de uma rede de terminais leves. Após, iremos analisar os pré-requisitos para implementação, entendendo o papel de cada serviço dentro da estrutura e por fim, um rápido workshop da instalação e configuração inicial do LTSP.","lecturer":"Felipe Cardoso Baptistini Pestana","field":"Infraestrutura e Redes, Hardware ","scheduleBegin":"9:15","scheduleEnd":"10:50","room":"em brevede Informática","vacancies":50,"editionId":0}],"lectures":[{"title":"A Experiência da Rádio UFSCar na Utilização e Disseminação das Tecnologias Livres para Radiodifusão","description":"Criada em 2007, a Rádio UFSCar foi a primeira emissora FM do Brasil a entrar no ar 24h por dia funcionando de forma automatizada 100% em Software Livre. Desde sua estrutura de gravação e edição de programas, até acervo, produção e execução de conteúdos radiofônicos, a emissora utiliza softwares de código aberto de forma inovadora e integrada. Dentre estes softwares estão o Ardour (Gravação e Edição Multipista), Audacity (Gravação e Edição Simples) e o Rivendell (Acervo, Execução e Automação). No caso do Rivendell, a Rádio UFSCar foi a primeira a utilizar este complexo e fundamental software que funciona como o cérebro mestre da emissora, e também é a tecnologia que a equipe mais vem se empenhando para desenvolver. A primeira tradução parcial do mesmo foi realizada pela equipe da Rádio UFSCar e hoje a emissora vem construindo um Acordo de Cooperação com o Ministério das Comunicações e criando parcerias com o Pontão de Cultura Nós Digitais para avançar nesta tradução, no desenvolvimento e disseminação do Software. Hoje a demanda de utilização do Rivendell é enorme nacionalmente e esta articulação busca hoje parceiros para avançar","lecturer":"Ricardo Rodrigues da Silva","field":"","scheduleBegin":"14:00","scheduleEnd":"14:50","room":"em brevepiso superior","editionId":0},{"title":"Stoq – Gestão Empresarial com Software Livre","description":"A suíte de aplicativos Stoq é um conjunto inovador de aplicativos de gestão empresarial disponibilizado como software livre e em desenvolvimento a mais de 10 anos pela empresa Async Open Source localizada em São Carlos – SP. Atualmente com uma base de usuários espalhados pelo país, cresce a cada dia. Nesta palestra faremos uma apresentação de algumas das principais funcionalidades do Stoq como o gerenciamento de serviços e produtos, realização de compras e vendas, emissão de documentos fiscais (NF, NF-e e Cupom Fiscal), controle de estoque, controle financeiro, etc. Comentaremos também sobre alguns casos de sucesso de implementação na industria e comercio dando dicas e tirando dúvidas de como você poderia implementar em sua empresa. Por fim, apresentaremos o programa de representantes Stoq, cujo objetivo é oferecer às pessoas e empresas interessadas um modelo de negócios baseado em software livre.","lecturer":"Thiago Bellini","field":"","scheduleBegin":"16:00","scheduleEnd":"16:50","room":"em brevepiso superior","editionId":0},{"title":"Flumotion – Uma Solução Livre para Streaming na Web","description":"Com o crescente avanço de tecnologias para a internet, hoje já torna-se possível estender eventos, que antes só eram possíveis presencialmente, para a toda a web. Através dos novos padrões, como a HTML5, a aproximação dos meios distintos (como sistemas operacionais, navegadores, dispositivos móveis etc.) realiza-se mais facilmente. No entanto, devido a grande variedade existente, empresas responsáveis por esses meios tem a autonomia de adotar esses padrões ou não. Sendo assim, atender a todos não é uma tarefa trivial. Este projeto tem como objetivo apresentar o Flumotion, uma solução de streaming livre e escalável, que atende a maior parcela possível de usuários, com qualidade e interoperabilidade. Mesmo aos que não possuem meios padronizados a HTML5, ou utilizam uma versão legada do mesmo.","lecturer":"Leandro Toledo de Souza","field":"","scheduleBegin":"13:00","scheduleEnd":"13:50","room":"em brevepiso superior","editionId":0}],"supporters":[],"installFest":{"softwares":[]},"hostingPlace":{"name":"Sesc São Carlos","address":{"street":"Avenida Comendador Alfredo Maffei","number":700,"district":"Jardim Gilberton","city":"São Carlos","state":"São Paulo"},"latitude":-22.016883,"longitude":-47.906345},"year":2013},{"courses":[{"title":"Git e contribuição para projetos Open Source","description":"Git é uma ferramenta bastante útil para o controle de versões de desenvolvimento. Utilizando servidores como Github e Bitbucket temos um ótimo apoio para o desenvolvimento de projetos em grupo. Além disso o Github é um dos maiores repositórios de projetos open source. O objetivo deste minicurso é ensinar um pouco de Git e Github permitindo que público possa utilizar controle de versão nos seus projetos e também seja capaz de contribuir com projetos open source que estejam hospedados no Github.","lecturer":"Bruno Henrique Orlandi","field":"Desenvolvimento","scheduleBegin":"14:30","scheduleEnd":"17:00","room":"em brevede Informática","vacancies":50,"editionId":0},{"title":"Nanocurso sobre Linux: o que, para que e para quem?","description":"Neste nanocurso serão tratados pontos básicos do Linux, sua história, sua estrutura, formas de instalação de pacotes e programas. Os exemplos serão expostos na distribuição Ubuntu, porém outros comentários serão realizados sobre as mais conhecidas distribuições como Debian, Fedora entre outras. Em adição, trataremos de programas alternativos as versões comerciais como Libre Office e Gimp. Por fim, falaremos um pouco sobre suas vantagens em relação a outros sistemas operacionais. Se o público for estritamente pessoas com prévio conhecimento básico em Linux, poderemos avançar um pouco mais sobre Shell Script e algumas aplicações em programação. No caso contrário, se o público for massivamente iniciante, trataremos pontos mais básicos e de uso geral. Outline: Histórico, estrutura, comandos, programação, utilidades e dicas.","lecturer":"Daniel Cosmo Pizetta","field":"Sistemas Operacionais","scheduleBegin":"11:00","scheduleEnd":"13:30","room":"em brevede Informática","vacancies":50,"editionId":0}],"lectures":[{"title":"Sistema Operacional Debian e FreeBSD","description":"Uma breve abordagem da história, desenvolvimento e crítica aos Sistemas Operacionais Debian e FreeBSD e suas distribuições.","lecturer":"Bruno Melo","field":"Sistemas Operacionais","scheduleBegin":"11:50","scheduleEnd":"12:40","room":"em brevepiso superior","editionId":0},{"title":"Comunicação Internacional, Democracia Linguística e Software Livre","description":"Como a questão da comunicação internacional afeta o desenvolvimento e utilização de softwares livres. As liberdades fundamentais, conceitos básicos do Software Livre, são decisivamente impactadas pelo problema linguístico mundial. Da mesma forma que o Software Livre visa democratizar e tornar mais justo o desenvolvimento e utilização da tecnologia de informação, contrariando interesses e o senso comum, também há uma solução para o problema linguístico internacional que se relaciona de diversas maneiras com os conceitos e com o movimento do Software Livre, essa solução se chama \"Esperanto\", a verdadeira língua internacional, que atualmente é utilizada em mais de 115 países em todo o mundo e por um número, cada vez maior, de desenvolvedores, aficionados e usuários do Software Livre. Nessa palestra traremos essa discussão a tona da mesma forma como já ocorreu em diversos outros eventos Flisol e Fisl pelo Brasil e relacionados ao Software Livre pelo mundo.","lecturer":"Alexsandro Cesário","field":"Comunicação","scheduleBegin":"11:00","scheduleEnd":"11:50","room":"em brevepiso superior","editionId":0},{"title":"Liberte Seu Desktop com Fedora","description":"Fedora é um sistema operacional baseado em linux que apresenta o que há de mais recente em software livre. O Fedora é sempre livre para qualquer um usar, modificar, e distribuir. Ele é feito por pessoas que gostam de liberdade Criativa e trabalham juntas como uma comunidade .","lecturer":"Davi Tenorio de Souza","field":"Sistemas Operacionais","scheduleBegin":"12:40","scheduleEnd":"13:30","room":"em brevepiso superior","editionId":0},{"title":"A Computação em Nuvem e seus impactos no cenário atual e futuro","description":"Tendo surgido como uma iniciativa da indústria, a computação em nuvem está recebendo uma grande atenção do meio acadêmico atualmente. Na literatura é possível notar um número crescente de trabalhos científicos relacionados ao tema, muitos deles propondo métodos, processos e ferramentas relacionadas ao conceito de nuvem. Além disso, os pesquisadores estão tentando identificar e formalizar os principais conceitos relacionados às tecnologias de nuvem, formando uma base para pesquisas futuras sobre como essa tecnologia pode promover avanços nas diversas áreas da ciência da computação. Todavia, enquanto os principais problemas e oportunidades relacionadas à computação em nuvem em geral são bem conhecidos, na Engenharia de Software tais problemas não são tão claros. Esta palestra visa apresentar os conceitos básicos relacionados ao modelo de nuvem, os principais problemas de pesquisa relacionados a essa tecnologia, bem como o impacto que a mesma pode causar no conVARCHARo de soluções de software livre e serviços.","lecturer":"Elias Adriano","field":"Desenvolvimento, Infraestrutura e Redes","scheduleBegin":"14:30","scheduleEnd":"15:20","room":"em brevepiso superior","editionId":0},{"title":"Zentyal – O pacote completo da redes","description":"Apresentação do que é, como funciona e alguns dos recursos existentes no Zentyal, para facilitar e melhorar o gerenciamento dos serviços de infra-estrutura de rede local, VPN e etc.","lecturer":"Felipe Pestana","field":"Infraestrutura e Redes","scheduleBegin":"15:20","scheduleEnd":"16:10","room":"em brevepiso superior","editionId":0},{"title":"Desenvolvimento Mobile Híbrido","description":"Apresentar ferramentas e arquitetura para a implementação de aplicativos mobile utilizando as tecnologias PhoneGap e jQuery Mobile. Também será apresentado um estudo de caso de um aplicativo desenvolvido pela Orbitive Agência Digital para o ComGru.","lecturer":"Eduardo Dotto Martucci","field":"Desenvolvimento e Programação Mobile","scheduleBegin":"16:10","scheduleEnd":"17:00","room":"em brevepiso superior","editionId":0}],"supporters":[],"installFest":{"softwares":[{"name":"Ubuntu","version":"14.04","website":"www.ubuntu.com","notes":"Unity, DVD 64-bit","category":"Sistema Operacional"},{"name":"Linux Mint","version":"14","website":"www.linuxmint.com","notes":"Cinnamon, DVD 64-bit","category":"Sistema Operacional"},{"name":"openSUSE","version":"13.1","website":"https://pt.opensuse.org","notes":"KDE DVD","category":"Sistema Operacional"},{"name":"Fedora","version":"20","website":"https://getfedora.org/","notes":"Gnome, DVD 64-bit","category":"Sistema Operacional"},{"name":"7-zip","version":"4.2.3","website":"www.7-zip.org","notes":"Versões 32 e 64 bits","category":"Compactador"},{"name":"LibreOffice","version":"4.2.3","website":"http://www.libreoffice.org/","notes":"Versão 32 bits","category":"Suíte de Escritório"},{"name":"GIMP","version":"2.8.10","website":"www.gimp.org","notes":"Versão 32 bits","category":"Edição de Imagem"},{"name":"Inkscape","version":"0.48.4","website":"www.inkscape.org/pt/","notes":"Versão 32bit instalável e portável","category":"Edição de Imagem"},{"name":"Audacity","version":"2.0.5","website":"http://audacity.sourceforge.net/?lang\u003dpt-BR","notes":"Versão 32 bits","category":"Editor de Áudio"},{"name":"VLC","version":"2.1.3","website":"www.videolan.org/vlc","notes":"Versões 32 e 64 bits","category":"Player de Áudio"},{"name":"Firefox","version":"28.0","website":"www.mozilla.org/firefox","notes":"Versão 32 bits","category":"Navegador Web"},{"name":"Thunderbird","version":"24.4.0","website":"www.mozilla.org/thunderbird","notes":"Versão 32 bits","category":"Cliente de E-mail"},{"name":"Filezilla","version":"3.8.0","website":"https://filezilla-project.org/","notes":"Versão 32 bits","category":"FTP"},{"name":"Frets On Fire","version":"1.3.10","website":"http://fretsonfire.sourceforge.net/","notes":"Versão 32 bits","category":"Jogo"},{"name":"Notepad++","version":"1.7.2","website":"http://notepad-plus-plus.org","notes":"","category":"Editor de Texto"},{"name":"PDF Creator","version":"6.5.5","website":"http://www.pdfforge.org/pdfcreator","notes":"","category":"PDF"},{"name":"XBMC","version":"12.3","website":"http://xbmc.org/","notes":"","category":"Media Center"},{"name":"Prey","version":"0.6.2","website":"https://preyproject.com/blog/tag/linux","notes":"Versão 32 bits","category":"Sistema Antifurto"}]},"hostingPlace":{"name":"Sesc São Carlos","address":{"street":"Avenida Comendador Alfredo Maffei","number":700,"district":"Jardim Gilberton","city":"São Carlos","state":"São Paulo"},"latitude":-22.016883,"longitude":-47.906345},"year":2014},{"courses":[{"title":"Disponibilizando dependências PHP com Composer, GitHub e Packagist","description":"Usar gerenciamento de dependência é a maneira recomendada para incluir código de terceiros aos nosso projetos. Em desenvolvimento PHP, usamos Composer para gerenciar pacotes. Neste minicurso, desenvolveremos um módulo simples em PHP aplicando conceitos de Namespace. Após publicado no GitHub e Packagist, outros desenvolvedores poderão incluir esses módulos em seus projetos. Mesmo com o grau de conhecimento selecionado em \u0027intermediário\u0027, os exemplos demonstrados em aula serão didáticos e abordaram conhecimentos básicos de php, composer e git. Esse nível foi selecionado apenas pela quantidade de tecnologias exibidas.O conteúdo apresentado será disponibilizado em SlideShare e GitHub. Formulários e pesquisas de opinião serão realizados para definir o perfil dos ouvintes e avaliar a qualidade do minicurso.","lecturer":"Thiago Henrique Poiani","field":"Programação / Desenvolvimento de Software","scheduleBegin":"em breve","scheduleEnd":"em breve","room":"em breve","vacancies":40,"editionId":0},{"title":"Desvendando a Raspberry Pi B","description":"Apresentação do tão famoso e popular computador de bolso Raspberry PI, este que já possui 4 versões e cada vez mais encanta o publico. Demonstrar como embarcar a distribuição oficial Raspbian e como ter acesso a placa para desenvolver aplicações, mostrar as demais distribuições oferecidas no site oficial. Mostrar ferramentas que podem ser utilizadas para construir uma distribuição customizada de acordo com a sua necessidade.","lecturer":"Cleiton Rafael Bueno de Oliveira","field":"Programação / Desenvolvimento de Software, Hardware, Embarcados","scheduleBegin":"em breve","scheduleEnd":"em breve","room":"em breve","vacancies":40,"editionId":0}],"lectures":[{"title":"Universalização da Web","description":"Quando tratamos do conceito de acessibilidade, podemos definir que é a possibilidade de qualquer pessoa, independentemente de suas capacidades físico-motoras e perceptivas, culturais e sociais, usufruir os benefícios de uma vida em sociedade, ou seja, é a possibilidade de participar de todas as atividades, até as que incluem o uso de produtos, serviços e informação, com o mínimo de restrições possível. No Brasil, segundo o IBGE, existem 24,5 milhões de pessoas (14,5% da população) com alguma deficiência. Como podemos observar no nosso cenário atual, os sites acessíveis na web propiciam aos seus usuários conhecimentos informativos, ajudando ainda seus usuários com deficiência a participarem de comunidades virtuais, e desta forma torna possível que estas pessoas sintam-se mais ativas, provendo um grande impacto a nível pessoal e também dentro da sociedade. Não exige conhecimentos muito aprofundados em programação HTML, a palestra é mais uma conceituação da importância da acessibilidade web e diretrizes de desenvolvimento.","lecturer":"Pablo Bizzi Mahmud","field":"Programação / Desenvolvimento de Software, Ações Sociais, Educação","scheduleBegin":"em breve","scheduleEnd":"em breve","room":"em breve","editionId":0},{"title":"Graph Database Application Using Neo4j","description":"Such as relational databases, most graphs databases are OLTP databases (online transaction processing) of generic use and can be used to produce a wide range of solutions. That said, they shine particularly when the solution depends, first, on our understanding of how things are connected. This is more common than one may think. And in many cases it is not only how things are connected but often one wants to know something about the different relationships in our field - their names, qualities, weight and so on. Briefly,connectivity is the key. The graphs are the best abstraction one has to model and query the connectivity; databases graphs in turn give developers and the data specialists the ability to apply this abstraction to their specific problems. For this purpose, this work aim at using this approach to make some simulation, such as the route planner application, capable of querying connected data. Merely having keys and values is not enough; no more having data partially connected through joins semantically poor. We need both the connectivity and contextual richness to operate these solutions.","lecturer":"Steve Ataky Tsham Mpinda","field":"Programação / Desenvolvimento de Software, Banco de Dados Orientado Grafos","scheduleBegin":"em breve","scheduleEnd":"em breve","room":"em breve","editionId":0},{"title":"Soluções de Firewall e Monitoramento usando Software Livre","description":"Apresentarei em overview as melhores soluções de firewall e monitoramento de infraestrutura de ativos de rede baseados em software livre. Os firewalls apresentados serão as soluções Endian e PFSense. Em monitoramento, falarei a respeito do Zabbix e seus recursos.","lecturer":"Felipe Pestana","field":"Infraestrutura e Redes","scheduleBegin":"em breve","scheduleEnd":"em breve","room":"em breve","editionId":0},{"title":"Criando aplicações ambiciosas usando Ember.js","description":"Criando aplicações sérias e robustas para web hoje é muito simples utilizando projetos open source como Ember.js. Nesta palestra mostro modos e casos de uso de Ember.js e como a comunidade brasileira tem participado.","lecturer":"Jean Lucas Monteiro Lima Cabreira","field":"Programação / Desenvolvimento de Software","scheduleBegin":"em breve","scheduleEnd":"em breve","room":"em breve","editionId":0},{"title":"Processos de Desenvolvimento de Software\tFluxo de desenvolvimento com Git","description":"A presente palestra tem como objetivo demonstrar a importância de se definir e formalizar um fluxo de desenvolvimento de software. Utilizando o Git como ferramenta de versionamento de código, metodologias ágeis de gerenciamento e apoiando-se em boas práticas do segmento, serão mostradas as etapas de construção de um fluxo de desenvolvimento de software que se encaixe nas características do seu time. Serão apresentados ainda fluxos utilizados com sucesso em grandes empresas como Google, Microsoft, Motorola e como utilizá-los em suas equipes.","lecturer":"Bruno Ricardo Siqueira","field":"Programação / Desenvolvimento de Software","scheduleBegin":"em breve","scheduleEnd":"em breve","room":"em breve","editionId":0},{"title":"Jornalismo, Blogging\tWordpress: da produção livre de conteúdo em blogs ao e-commerce empresarial","description":"O Wordpress é atualmente a ferramenta de gerenciamento de conteúdos na web mais usada. Foi concebido inicialmente para gerenciamento de blogs mas é usado hoje para o gerenciamento de qualquer tipo de site. Esses sites podem ser um simples blog até um e-commerce profissional, passando por portais de notícias, sites institucionais e outros. Com início numa abordagem histórica da interação social na internet a palestra tem mostra o wordpress como um software livre com amplas possibilidades. Desde de atuação no mercado assim como a criação de notícias e conteúdo livre visando a ampliação e democratização da comunicação.","lecturer":"Rodrigo Barreto","field":"Programação / Desenvolvimento de Software","scheduleBegin":"em breve","scheduleEnd":"em breve","room":"em breve","editionId":0},{"title":"Se Tranque e Jogue a Chave Fora: Como se Proteger na Era da Internet","description":"Mais de vinte anos se passaram desde a popularização da Internet e ela saltou das telas em nossos escritórios para nossos bolsos, geladeiras e até mesmo marcapassos. Mas termos como “criptografia” ainda soam grego e para muita gente, a senha que criaram em 2001 para usar o Orkut continua a mesma. Por que essa diferença? No amanhecer da Internet das Coisas, entender como se proteger é urgente. Este trabalho busca munir o público com os últimos conceitos e ferramentas em segurança. Com base no Modelo de Schneier [0], que nos ajuda a abordar a segurança de um ponto de vista racional, discutiremos por que e como viver (relativamente) tranquilos na Internet. [0]: http://www.zwilnik.com/?page_id\u003d577","lecturer":"Rafael Beraldo","field":"Infraestrutura e Redes, Educação","scheduleBegin":"em breve","scheduleEnd":"em breve","room":"em breve","editionId":0},{"title":"Ferramentas Livres para a gestão de projetos Ágeis com Scrum","description":"Diferenças entre o modelo tradicional e o modelo ágil de desenvolvimento. Scrum segundo o ScrumGuide da Scrum.org.","lecturer":"Thiago Silva Barros","field":"Gerenciamento de  Projetos","scheduleBegin":"em breve","scheduleEnd":"em breve","room":"em breve","editionId":0},{"title":"Comunicacao integrada usando SACI","description":"O Sistema de Apoio à Comunicação Integrada - SACI foi criado em 2007 por um grupo de alunos da UFSCar. Concebido desde seu início como software livre, hoje ele faz parte da realidade de várias instituições de ensino e empresas, ajudando-as a administrar de maneira eficiente suas equipes de colaboradores, fluxos de trabalho e produção midiática. Nesta palestra falaremos mais sobre o SACI, o contexto histórico em que ele foi criado, suas principais funcionalidades e como o formato de software livre o ajudou a evoluir e a se popularizar.","lecturer":"Alex Fernando Orlando","field":"Jornalismo","scheduleBegin":"em breve","scheduleEnd":"em breve","room":"em breve","editionId":0}],"supporters":[{"name":"Senac","websiteTitle":"www.sp.senac.br","website":"http://www.sp.senac.br","image":"senac.png","businessPackage":"DIAMOND"},{"name":"Aptor Software","websiteTitle":"www.aptor.com.br","website":"http://www.aptor.com.br/","image":"aptor.png","businessPackage":"GOLD"},{"name":"UAi.Tecnologia","websiteTitle":"www.uaitecnologia.com.br","website":"http://www.uaitecnologia.com.br/","image":"uaitecnologia.png","businessPackage":"GOLD"},{"name":"Grupo Lift","websiteTitle":"www.grupolift.com.br","website":"http://www.grupolift.com.br/","image":"grupolift.png","businessPackage":"BRONZE"},{"name":"Extreme Informática","websiteTitle":"Extreme Informática e Games (Facebook)","website":"https://www.facebook.com/pages/Extreme-Inform%C3%A1tica-e-Games/279995402061738","image":"extremeinformatica.png","businessPackage":"BRONZE"},{"name":"Design For Web","websiteTitle":"www.designforweb.com.br","website":"http://www.designforweb.com.br/","image":"designforweb.png","businessPackage":"SILVER"}],"installFest":{"softwares":[{"name":"Ubuntu","version":"14.04.2 LTS","website":"www.ubuntu.com","notes":"Unity","category":"Sistema Operacional"},{"name":"Linux Mint","version":"17.01","website":"www.linuxmint.com","notes":"Cinnamon","category":"Sistema Operacional"},{"name":"openSUSE","version":"13.2","website":"https://pt.opensuse.org","notes":"KDE","category":"Sistema Operacional"},{"name":"Debian","version":"7.8","website":"www.debian.org","notes":"Gnome\t","category":"Sistema Operacional"},{"name":"Fedora","version":"21","website":"https://getfedora.org/pt_BR","notes":"Gnome","category":"Sistema Operacional"},{"name":"Triskel","version":"7.0","website":"http://trisquel.info/","notes":"Gnome","category":"Sistema Operacional"},{"name":"7-zip","version":"9.20","website":"www.7-zip.org","notes":"","category":"Compactador"},{"name":"LibreOffice","version":"4.4.2","website":"http://www.libreoffice.org/","notes":"","category":"Suíte de Escritório"},{"name":"GIMP","version":"2.8.10","website":"www.gimp.org","notes":"","category":"Edição de Imagem"},{"name":"Inkscape","version":"0.91","website":"www.inkscape.org/pt/","notes":"","category":"Edição de Imagem"},{"name":"Audacity","version":"2.1.0","website":"http://audacity.sourceforge.net/?lang\u003dpt-BR","notes":"","category":"Editor de Áudio"},{"name":"VLC","version":"2.2.0","website":"www.videolan.org/vlc","notes":"","category":"Player de Áudio"},{"name":"Firefox","version":"37.0","website":"www.mozilla.org/firefox","notes":"","category":"Navegador Web"},{"name":"Thunderbird","version":"31.6.0","website":"www.mozilla.org/thunderbird","notes":"","category":"Cliente de E-mail"},{"name":"Filezilla","version":"3.10.3","website":"https://filezilla-project.org","notes":"","category":"FTP"},{"name":"Frets On Fire","version":"1.3.110","website":"http://fretsonfire.sourceforge.net/","notes":"","category":"Jogo"},{"name":"Notepad++","version":"6.7.5","website":"http://notepad-plus-plus.org","notes":"","category":"Editor de Texto"},{"name":"PDF Creator","version":"2.1","website":"http://www.pdfforge.org/pdfcreator","notes":"","category":"PDF"},{"name":"Clementine","version":"1.2","website":"https://www.clementine-player.org/pt_BR","notes":"","category":"Player de Áudio"},{"name":"Dia","version":"0.97.2","website":"https://wiki.gnome.org/Apps/Dia","notes":"Software alternativo ao Microsoft Visio e outros","category":"Diagramação"}]},"hostingPlace":{"name":"Senac São Carlos","address":{"street":"Rua Episcopal","number":700,"district":"Centro","city":"São Carlos","state":"São Paulo"},"latitude":-22.024825,"longitude":47.891287},"year":2015}]}